git_training.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>git-basics</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">git-basics</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org37d12b8">Git short introduction</a></li>
<li><a href="#orga6acc15">Inside Git</a></li>
<li><a href="#org40d5dc4">Workflow</a></li>
<li><a href="#orgb539b1b">submodule</a></li>
<li><a href="#orgadcc49f">Cooperative submodule</a></li>
<li><a href="#orgce2926d">internals</a></li>
<li><a href="#org3c78399">objects</a></li>
<li><a href="#orgb160f57">commit</a></li>
<li><a href="#orgba90d45">reference</a></li>
<li><a href="#org8e9aa88">advanced reference</a></li>
<li><a href="#org8aecdfa">remote</a></li>
<li><a href="#org03b1419">misc</a></li>
<li><a href="#org9d2a3be">git advanced</a></li>
</ul>
</div>
</div>
<p>
:ID:       8525d1c4-20e9-40ca-ab38-1d1bd88d0884
</p>

<div id="outline-container-org37d12b8" class="outline-2">
<h2 id="org37d12b8">Git short introduction</h2>
<div class="outline-text-2" id="text-org37d12b8">
<ul class="org-ul">
<li>'Git' not 'Jit'</li>
<li>days of diff and patch, bitkeeper</li>
<li>Goal: distributed development (coooperative? depends!)</li>
<li>linus torwald</li>
<li>very similar to blockchain Merkle Tree (hash tree)
<a href="https://stackoverflow.com/questions/46192377/why-is-git-not-considered-a-block-chain">why is git not a blockchain</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga6acc15" class="outline-2">
<h2 id="orga6acc15">Inside Git</h2>
<div class="outline-text-2" id="text-orga6acc15">
<ul class="org-ul">
<li>SHA is not a security feature, security is a by-product</li>
<li>objects:
blob, tree</li>
<li>references:
name for raw SHA-1 value; refs</li>
<li>porcelan vs plumbing:
git cat-file -t -p</li>
<li>features:
local, fast, efficient, distributed, snapshot not patches, changes</li>
<li>HEAD/Detached?</li>
</ul>
</div>
</div>

<div id="outline-container-org40d5dc4" class="outline-2">
<h2 id="org40d5dc4">Workflow</h2>
<div class="outline-text-2" id="text-org40d5dc4">
<ul class="org-ul">
<li>edit -&gt; stage(add) -&gt; review -&gt; commit</li>
<li>git-flow
<ul class="org-ul">
<li><a href="https://danielkummer.github.io/git-flow-cheatsheet/index.zh_CN.html">git flow cheetsheet</a></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgb539b1b" class="outline-2">
<h2 id="orgb539b1b">submodule</h2>
<div class="outline-text-2" id="text-orgb539b1b">
<ul class="org-ul">
<li>just update, track the new changes of the submodules (no change)</li>
<li>manually : git fetch</li>
<li>automatically: git submodule update &#x2013;remote
<ul class="org-ul">
<li>set specific branch .gitmodules submodule.submudle_name.branch stable</li>
<li>-f: tracked; no -f locally, not tracked.</li>
<li>git config status.submodulesummary 1</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgadcc49f" class="outline-2">
<h2 id="orgadcc49f">Cooperative submodule</h2>
<div class="outline-text-2" id="text-orgadcc49f">
<ul class="org-ul">
<li>git submodule update &#x2013;remote &#x2013;rebase/&#x2013;merge</li>
<li>caveats: has to commit locally.</li>
<li>publishing submodule changes: git push &#x2013;recurse-submodules=check/on-demand</li>
<li>caveats:
<ul class="org-ul">
<li>accidental revert: git submodule update &#x2013;remote to update .gitmodule; and commit in parent projects.</li>
<li>cannot merge: no submodule merge</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgce2926d" class="outline-2">
<h2 id="orgce2926d">internals</h2>
<div class="outline-text-2" id="text-orgce2926d">
<ul class="org-ul">
<li>index/stage, repository, working tree, remote;</li>
<li>plumbing:
<ul class="org-ul">
<li>git hash-object -w;</li>
<li>git cat-file -p/-t;</li>
<li>git update-index &#x2013;add &#x2013;cacheinfo</li>
</ul></li>
<li>file modes: 100644/100755/120000</li>
<li>git write-tree</li>
</ul>
</div>
</div>
<div id="outline-container-org3c78399" class="outline-2">
<h2 id="org3c78399">objects</h2>
<div class="outline-text-2" id="text-org3c78399">
<ul class="org-ul">
<li>Git is content-addressable filesystem
<ul class="org-ul">
<li>tree objects</li>
<li>blob</li>
<li><a href="https://git-scm.com/book/en/v2/Git-Internals-Git-Objects">commit objects</a></li>
<li>tag</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgb160f57" class="outline-2">
<h2 id="orgb160f57">commit</h2>
<div class="outline-text-2" id="text-orgb160f57">
<ul class="org-ul">
<li>Git commit: is a snapshot
<ul class="org-ul">
<li>Commit often!
<ul class="org-ul">
<li>history of your logic units of change</li>
<li>a story of history of the repository</li>
</ul></li>
</ul></li>
<li>metadta: contents, messages of author, timestamp,</li>
<li>change history, &#x2013;amend</li>
</ul>
</div>
</div>
<div id="outline-container-orgba90d45" class="outline-2">
<h2 id="orgba90d45">reference</h2>
<div class="outline-text-2" id="text-orgba90d45">
<ul class="org-ul">
<li>branch, HEAD, detached
<ul class="org-ul">
<li>branch: reference to the head of a line of work&#x2013;&gt;git update-ref refs/heads/master</li>
<li>HEAD: symbolic reference (pointer to a reference); or SHA-1 value of a git object</li>
<li>detatched HEAD: cannot commit (checkout a commit/tag/remote branch)
<ul class="org-ul">
<li>to save : git checkout -b foo/ git branch foo/ git tag foo</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org8e9aa88" class="outline-2">
<h2 id="org8e9aa88">advanced reference</h2>
<div class="outline-text-2" id="text-org8e9aa88">
<ul class="org-ul">
<li>git reflog -2 HEAD/ HEAD^^</li>
<li>git symbolic-ref</li>
<li>master^^</li>
<li>tags： branch reference; never moves</li>
</ul>
</div>
</div>
<div id="outline-container-org8aecdfa" class="outline-2">
<h2 id="org8aecdfa">remote</h2>
<div class="outline-text-2" id="text-org8aecdfa">
<ul class="org-ul">
<li>git remote add origin git@gitlab.work:ai/ref.git</li>
<li>git push</li>
<li>merge</li>
<li>rebase</li>
<li>stashing</li>
<li>log</li>
</ul>
</div>
</div>
<div id="outline-container-org03b1419" class="outline-2">
<h2 id="org03b1419">misc</h2>
<div class="outline-text-2" id="text-org03b1419">
<ul class="org-ul">
<li>commit amend</li>
<li>rename</li>
<li>gitignore</li>
<li>submodule,</li>
</ul>
</div>
</div>
<div id="outline-container-org9d2a3be" class="outline-2">
<h2 id="org9d2a3be">git advanced</h2>
<div class="outline-text-2" id="text-org9d2a3be">
<ul class="org-ul">
<li>git revert</li>
<li>git revision specification for
<ul class="org-ul">
<li>git log</li>
<li>git reset</li>
<li>git chery-pick</li>
</ul></li>
<li>git rebase</li>
<li>A beautiful magit</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-04-20 Thu 00:00</p>
<p class="creator">忻斌健</p>
</div>
</body>
</html>
